snlkuharlocal/src/DataProcessors/АвтоматическаяСверкаОстатков/АвтоматическаяСверкаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АвтоматическаяСверкаОстатков</name>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>ExchangePlanRef.Основной</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОтправлены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПолучены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФизическогоУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>EnumRef.ВидСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбмена77</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШКПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбменаПеремещениями</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <comment>Приоритет для сортировки в отчетах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКратности</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПути</name>
    <comment>Склад для оприходования товара который не доехал, или еще не принят складом</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НеНачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузкиТранзитом</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйОтдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладБухгалтерии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляРаспределенияЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапретаОтправкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольГрафикаОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляПеремещений</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НужноПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НужнаТермоусадка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозвратаСКомиссии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КарантинЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладМаркированногоТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтрольКратностиНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКратности</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/АвтоматическаяСверкаОстатков/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт

СверитьНаСторонеПодчУзла();	
КонецПроцедуры

Функция ПроверитьНаличиеКаталога(Знач ИмяКаталога, Знач ПроверятьЧтоНайденныйФайлЭтоКаталог = Ложь) Экспорт
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	Если ПустаяСтрока(ИмяКаталога) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ВыбФайл = Новый Файл(ИмяКаталога);
	Если Не ВыбФайл.Существует() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроверятьЧтоНайденныйФайлЭтоКаталог Тогда
		// проверка что это точно каталог
		Возврат ВыбФайл.ЭтоКаталог();
	Иначе
		// если без разницы каталог это или нет
		Возврат Истина;
    КонецЕсли;
	
КонецФункции

// Процедура создает каталог если его нет
Процедура СоздатьКаталогВСлучаеОтсутствия(Знач ИмяКаталога)
	
	// ищем нужный нам каталог, если его нет - то пытаемся создать
	НаличиеКаталогаОбмена = ПроверитьНаличиеКаталога(ИмяКаталога, Истина);
	
	Если НЕ НаличиеКаталогаОбмена Тогда
		// создаем вложенный каталог в темповый
		СоздатьКаталог(ИмяКаталога);
	КонецЕсли;
	
КонецПроцедуры

функция КопироватьФайл2(ИмяФайлаИсточника,ИмяФайлаПриемника,СоединениеFTP=Неопределено,НаFTP=Истина)
	Если СоединениеFTP=Неопределено тогда
	Копироватьфайл(ИмяФайлаИсточника,ИмяФайлаПриемника);
	иначе
	ИмяФайлаПриемника1=СтрЗаменить(ИмяФайлаПриемника,"\","/");
	ИмяФайлаИсточника1=СтрЗаменить(ИмяФайлаИсточника,"\","/");
	Если НаFTP тогда
	СоединениеFTP.Записать(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	иначе
	СоединениеFTP.Получить(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	Конецесли;
	Конецесли;
Конецфункции


Процедура СверитьНаСторонеПодчУзла() экспорт

	
	ЛокКаталог="C:\TEMP\";
	
	Узел=ПланыОбмена.Основной.ЭтотУзел();
	УзелЦ=ПланыОбмена.Основной.НайтиПоКоду("SNL");	
	// Получаем маску для поиска файлов с сообщениями обмена
	//МаскаФайлов = ПолучитьИмяФайлаОбмена(Узел.Ссылка, ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел(), "??????????","zip");
	
	//Пока из файла для отладки
    //КаталогВыгрузки=Сокрлп(Узел.АдресОбмена)+"\Sverka";		
	//ИмяФайлаОстатков = КаталогВыгрузки+"\_"+стр.узел.Код+"_"+Формат(ДатаОстатков,"ДФ=yyyy-MM-dd");
	
	Соединение=УстановитьFTPСоединение(УзелЦ.АдресОбмена,УзелЦ.Пользователь,УзелЦ.Пароль,,УзелЦ.ПассивныйРежим);
	
	//Добавим блок для копирования конфы (чтобы быстрее обновляли)
	
    Соединение.УстановитьТекущийКаталог("/SNL/CONF");
	файлы=	Соединение.Найтифайлы(,"*.cf");
	КаталогНаДиске=СОКРЛП(Константы.КаталогВнешнихОтчетов.Получить())+"\Conf\";
	СоздатьКаталогВСлучаеОтсутствия(КаталогНаДиске);
	файлы2=найтифайлы(КаталогНаДиске,"*.cf");
	Если Файлы.количество()<>0 тогда
		Для каждого файлфтп из файлы цикл
			//Ищем на диске
			Нашли=Ложь;
			Для каждого файлнадиске из файлы2 цикл
				если Врег(файлнадиске.имя)=Врег(файлфтп.имя) и файлнадиске.Размер()=файлфтп.размер() тогда
					Нашли=Истина;Прервать;
				Конецесли;
            Конеццикла;
			
			Если НЕ Нашли тогда
			Копироватьфайл2(файлфтп.имя,КаталогНаДиске+файлфтп.имя,Соединение,Ложь);	 
			Конецесли;
		
		Конеццикла;
	Конецесли;

	Соединение.УстановитьТекущийКаталог("");
 	Соединение.УстановитьТекущийКаталог("/SNL/SVERKA");
	файлы=	Соединение.Найтифайлы(,"*"+Сокрлп(узел.Код)+"*.*");

	
	Если Файлы.количество()=0 тогда
	//	Сообщить("Авто сверка:В каталоге FTP /Sverka нет файлов для этого узла");
	ЗаписатьВЛог("Регламент!","Сверка остатков. В каталоге FTP /Sverka нет файлов для этого узла","Информация");
		Возврат;
	Конецесли;
	

	
	для каждого файл из файлы цикл
		Если лев(файл.имя,3)="ERR" тогда продолжить; конецесли; 
		файл1=файл.имя;
		прервать;
	Конеццикла;	
	
	для каждого файл из файлы цикл
		Если лев(файл.имя,3)="ERR" тогда продолжить; конецесли;
		если файл.имя>файл1 тогда
			файл1=файл.имя;
		Конецесли;	
	Конеццикла;

	
	Попытка СоздатьКаталог(ЛокКаталог);Исключение;конецпопытки;
	//крохин начало 28.06.2013
	//в отсутствие файла не проверяем ничего
	Если файл1 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//крохин конец 28.06.2013
	ЛокФайл=ЛокКаталог+файл1;
	Соединение.получить(Файл1,ЛокФайл);
	ПозДаты=Найти(Файл1,"_20");
	
	ДатаОстатков=ДАТА(Сред(СтрЗаменить(файл1,"-",""),ПозДаты+1,8));
	
	ПроверкаСущ="ERR_"+Сокрлп(Узел.Код)+"_"+Формат(ДатаОстатков,"ДФ=yyyy-MM-dd")+".zip";
	файлы3=	Соединение.Найтифайлы(,ПроверкаСущ);
	Если Файлы3.количество()<>0 тогда
		ЗаписатьВЛог("Регламент!","Сверка остатков. В каталоге FTP /Sverka уже существует файл с ошибками для этого узла","Информация");
		Возврат;
	КонецЕсли;

	
	ЧтениеZIP=Новый ЧтениеZipФайла(ЛокФайл);
	ЧтениеZIP.ИзвлечьВсе(ЛокКаталог,РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ИмяФ=ЛокКаталог+СтрЗаменить(Файл1,".zip","");

	ТзОст=ЗначениеИзФайла(Имяф);

   //Определим список складов для узла
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		             |	Склады.Ссылка
		             |ИЗ
		             |	Справочник.Склады КАК Склады
		             |ГДЕ
		             |	Склады.ЭтоГруппа = ЛОЖЬ
		             |	И Склады.КодФизическогоУзла = &КодФизическогоУзла
		             |	И (НЕ Склады.СкладПути.Код ЕСТЬ NULL )";
					 
		запрос.УстановитьПараметр("КодФизическогоУзла",Узел.код);
		
		СписСкл=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	//Получим остатки  и сравним 2 таблицы
	Запрос=новый запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура.Код КАК код,
	|	-СУММА(ОстаткиТМЦОстатки.КоличествоОстаток) КАК количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&НаДату, Склад В (&СписСкл)) КАК ОстаткиТМЦОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦОстатки.Номенклатура.Код";
	
	//И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипСклада.склад)	
	Запрос.УстановитьПараметр("НаДату",Новый Граница(КонецДня(ДатаОстатков),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписСкл",СписСкл);
		
    ТзТек=Запрос.выполнить().Выгрузить();
	
	 Для каждого стр2 из ТзОст цикл
		 новстр=ТзТек.Добавить();
		 ЗаполнитьЗначенияСвойств(новстр,стр2);
	 Конеццикла;

	 тзтек.Свернуть("Код","Количество"); //,Сумма
  	 
	//Выгрузим расхождения в виде карточек 

	для ном=0 по  ТзТек.Количество()-1 цикл
		Если Ном>=ТзТек.Количество() тогда
			прервать;
		Конецесли;	
		      стр2=тзтек[ном];
			  если стр2.количество=0 тогда    // и стр2.сумма=0
				   ТзТек.Удалить(стр2);ном=ном-1;
			  Конецесли;		  
			   
	Конеццикла;	  

	 Запрос=Новый Запрос;
	 Запрос.Текст="ВЫБРАТЬ
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор.Номер КАК Номер,
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор.Дата КАК Дата,
	              |	СУММА(ОстаткиТМЦОстаткиИОбороты.КоличествоПриход) КАК ПриходКолво,
	              |	СУММА(ОстаткиТМЦОстаткиИОбороты.КоличествоРасход) КАК РасходКолво,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Номенклатура.Код ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Номенклатура.Код
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Номенклатура.Код
	              |	КОНЕЦ КАК Код,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Номенклатура.Наименование ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Номенклатура.Наименование
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Номенклатура.Наименование
	              |	КОНЕЦ КАК Наименование,
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор КАК регистратор1,
	              |	""     "" КАК регистратор,
	              |	ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Склад.Наименование ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Склад.Наименование
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Склад.Наименование
	              |	КОНЕЦ КАК Склад
	              |ИЗ
	              |	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(
	              |			&Нач,
	              |			&Кон,
	              |			Регистратор,
	              |			,
	              |			Номенклатура.Код В (&СписокКодов)
	              |				И Склад В (&СписСкл)) КАК ОстаткиТМЦОстаткиИОбороты
	              |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	              |				&Кон,
	              |				Номенклатура.Код В (&СписокКодов)
	              |					И Склад В (&СписСкл)) КАК ОстаткиТМЦОстатки
	              |		ПО ОстаткиТМЦОстаткиИОбороты.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор,
	              |	ОстаткиТМЦОстатки.КоличествоОстаток,
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор.Номер,
	              |	ОстаткиТМЦОстаткиИОбороты.Регистратор.Дата,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Номенклатура.Код ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Номенклатура.Код
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Номенклатура.Код
	              |	КОНЕЦ,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Номенклатура.Наименование ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Номенклатура.Наименование
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Номенклатура.Наименование
	              |	КОНЕЦ,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТМЦОстаткиИОбороты.Склад.Наименование ЕСТЬ NULL 
	              |			ТОГДА ОстаткиТМЦОстатки.Склад.Наименование
	              |		ИНАЧЕ ОстаткиТМЦОстаткиИОбороты.Склад.Наименование
	              |	КОНЕЦ";
				  
				//И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипСклада.склад)
				//И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипСклада.склад)
				
				  Запрос.УстановитьПараметр("СписСкл",СписСкл);
				  Запрос.УстановитьПараметр("СписокКодов",ТзТек.ВыгрузитьКолонку("Код"));
				  Запрос.УстановитьПараметр("Нач",НачалоМесяца(ДатаОстатков));
				  Запрос.УстановитьПараметр("Кон",новый граница (Конецдня(КонецМесяца(ДатаОстатков)),ВидГраницы.Включая));
                  				  
				 Тз=запрос.Выполнить().Выгрузить();
				 Для Каждого СтрокаТз Из ТЗ Цикл
					 Если СтрокаТз.Регистратор1 <> Неопределено и НЕ СтрокаТз.регистратор1 = NULL Тогда
					 СтрокаТз.Регистратор = СтрокаТз.Регистратор1.Метаданные().Синоним; 
					 КонецЕсли;
				 КонецЦикла;

	//Состояние("Отправка...");	


	ИмяфайлаСКосяками="ERR_"+Сокрлп(Узел.Код)+"_"+Формат(ДатаОстатков,"ДФ=yyyy-MM-dd"); 
	ЗначениеВФайл(ЛокКаталог+ИмяфайлаСКосяками,Тз);	


	Заархивироватьфайл(ЛокКаталог+ИмяфайлаСКосяками,ЛокКаталог+ИмяФайлаСКосяками+".zip");
	Соединение.Записать(ЛокКаталог+ИмяФайлаСКосяками+".zip",ИмяФайлаСКосяками+".zip");
	//Все расхождения выгружены в тот же каталог,что и файл с остатками
    ЗаписатьВЛог("Регламент!","Сверка остатков. Файл +"+ЛокКаталог+ИмяфайлаСКосяками + " выгружен","Информация");		 
	Конецпроцедуры
